Revit 2027 API
SingleServerService.GetActiveServerId Method
 Returns the Id of the currently active application-level server of the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetActiveServerId()
Public Function GetActiveServerId As Guid
public:
Guid GetActiveServerId()
member GetActiveServerId : unit -> Guid
Return Value
Guid
 The GUID of the active server, or an invalid GUID if there is no active server assigned.
See Also
Reference
SingleServerService Class
GetActiveServerId Overload
Autodesk.Revit.DB.ExternalService Namespace